month = int(input("Введите номер месяца от 1 до 12: "))
seasons_list = ["зима", "зима", "весна", "весна", "весна",
                "лето", "лето", "лето", "осень", "осень", "осень", "зима"]
seasons_dict = {1: "зима", 2: "зима", 3: "весна", 4: "весна", 5: "весна",
                6: "лето", 7: "лето", 8: "лето", 9: "осень",
                10: "осень", 11: "осень", 12: "зима"}
if 1 <= month <= 12:
    print(f'{seasons_list[month - 1]}')
    print(f'Да, да - это {seasons_dict.get(month)}')
else:
    print(f'В году 12 месяцев, месяца №{month} не существует')